manmuqingshan/trail-mate/builds/esp_idf/targets/tdeck/sdkconfig.defaults
# Minimal ESP-IDF compile baseline derived from boards/T-Deck.json.
# Hardware-specific PSRAM/display validation remains pending.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# Resource packs contain long archive, directory, and asset names.
CONFIG_FATFS_LFN_HEAP=y
